Revit 2024 API
ParameterTypeId.FbxLightEmitCircleDiameter Property
 "Emit from Circle Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FbxLightEmitCircleDiameter { get; }
Visual Basic
Public Shared ReadOnly Property FbxLightEmitCircleDiameter As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FbxLightEmitCircleDiameter {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace